In [1]:
import pandas as pd

In [3]:
s = pd.Series([71, 84, 56, 23, 56, 98, 56])

In [4]:
type(s)

pandas.core.series.Series

In [14]:
s2 = pd.Series([71, 84, 56, 23, 56, 98, 56], index=["Harry", "Shubh", "Rohan", "Aakash", "Kirti", "John", "Rehan"])

In [15]:
print(s2)

Harry     71
Shubh     84
Rohan     56
Aakash    23
Kirti     56
John      98
Rehan     56
dtype: int64

In [18]:
s2["Harry"]

71

In [19]:
s2["Rohan"]

56

In [20]:
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

In [21]:
df = pd.DataFrame(data)

In [22]:
df

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [23]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [24]:
df.columns

Index(['name', 'age', 'city'], dtype='object')